{
  "profession": "software developer",
  "study": "software engineering student",
  "welcome": "Hi There! I'm Vitor",
  "professional_experience": "professional experience",
  "academic_education": "academic education",
  "professional_experience_info": [
    {
      "path": "~/experience/dev",
      "experience": [
        {
          "title": "software_developer",
          "date": "2022 - present",
          "company": "Boavista Tecnologia, Fortaleza, BRL",
          "description": [
            "Proficient in creating and maintaining applications using the Spring Boot framework. I have knowledge in JPA, JUnit Jupiter for testing, native queries, test-driven development, solid design principles, and PostgreSQL database management.",
            "Actively involved in modernizing systems, including the creation of a new deployment system with Java 17 and the successful migration of a legacy Java 8 API to Java 17, significantly improving system efficiency and maintainability.",
            "Developed dynamic and responsive user interfaces using technologies ranging from React to Angular."
          ]
        }
      ]
    },
    {
      "path": "~/experience/infra",
      "experience": [
        {
          "title": "infrastructure_analyst",
          "date": "2022 - 2022",
          "company": "Euroamerican, Jandira, BRL",
          "description": [
            "Maintenance of Windows servers, administration of Exchange, DHCP, DNS, backups, AD, firewalls, and proxies",
            "Resolved day-to-day issues involving networks, user support, and file and application storage",
            "Performed hardware and software installation/configuration, system migrations, and software tool updates"
          ]
        },
        {
          "title": "it_intern",
          "date": "2021 - 2022",
          "company": "Euroamerican, Jandira, BRL",
          "description": []
        }
      ]
    }
  ],
  "academic_education_info": [
    {
      "path": "~/academic/graduation",
      "experience": [
        {
          "title": "software_engineer",
          "date": "2023 - 2024",
          "company": "Uniamerica, BRL",
          "description": []
        },
        {
          "title": "system_analysis_and_development",
          "date": "2021 - 2023",
          "company": "Universidade Nove de Julho, São Paulo, BRL",
          "description": []
        }
      ]
    },
    {
      "path": "~/academic/high_school",
      "experience": [
        {
          "title": "it_maintenance_and_support",
          "date": "2018 - 2020",
          "company": "Instituto Tecnico de Barueri, Barueri, BRL",
          "description": []
        }
      ]
    }
  ],
  "resume": "I'm a technology enthusiast who began exploring the world of programming at around 15 years old. Currently, I'm a software engineering student and work as a developer at one of the leading credit reconciliation companies in Brazil. My journey includes a degree in Systems Analysis, and I have prior experience in infrastructure. In my day-to-day work, I build robust applications using technologies such as Java with Spring Boot, React, Angular, JavaScript, and TypeScript. I always prioritize Test-Driven Development (TDD) and the SOLID principles to maintain code quality. In my spare time, my curiosity drives me to explore innovative technologies like Golang, Docker, Kubernetes, and Kafka to stay up-to-date with the latest advancements in the world of technology. My passion for solving problems through code motivates me to be in constant learning",
  "project-title": "Projects",
  "project-info": [
    {
      "title": "music-streamer-api",
      "description": "This is a repository for uploading and downloading music with a built-in player, allowing users to upload, download, and listen to music.",
      "uri_github": "/music-streamer-api",
      "tag": [
        "Java",
        "JPA"
      ]
    },
    {
      "title": "my-personal-blog",
      "description": "This repository corresponds to this website.",
      "uri_github": "/my-personal-blog",
      "tag": [
        "React",
        "TypeScript"
      ]
    },
    {
      "title": "school-web",
      "description": "This repository is my first project using React with backend integration.",
      "uri_github": "/school-web",
      "tag": [
        "React",
        "JavaScript"
      ]
    },
    {
      "title": "school-api",
      "description": "This repository is a backend for the school-web project. Initially, it was developed in JavaScript, but later it was rewritten in Java.",
      "uri_github": "/school-api",
      "tag": [
        "NodeJS",
        "Sequelize"
      ]
    }
  ]
}