{
  "profession": "desenvolvedor de software",
  "study": "desenvolvedor de software",
  "welcome": "Eaaai! Eu sou o Vitor",
  "professional_experience": "experiência profissional",
  "academic_education": "formação acadêmica",
  "professional_experience_info": [
    {
      "path": "~/experiencia/dev/ci_and_t",
      "company": "CI&T, São Paulo, BR",
      "experience": [
        {
          "title": "desenvolvedor_de_software_pleno",
          "date": "ago/2022 - presente",
          "work_type": "Remoto",
          "description": []
        }
      ]
    },
    {
      "path": "~/experiencia/dev/boavista",
      "company": "Boavista Tecnologia, Fortaleza, BR",
      "experience": [
        {
          "title": "desenvolvedor_de_software_junior",
          "date": "out/2023 - ago/2024",
          "work_type": "Remoto",
          "description": [
            "Code Review durante o fluxo das solicitações de pull/merge request, garantindo a qualidade do código e o entendimento do negócio.",
            "Desenvolvi estratégias de arquitetura para funcionalidades e modelos de dados complexos, assegurando a escalabilidade e a manutenibilidade do sistema.",
            "Contribuí para o desenvolvimento de um processador de arquivos e realizei a manutenção de processadores de catalogação de arquivos orientados a eventos, utilizando Spring Batch e Kafka.",
            "Proficiente na criação e manutenção de aplicativos usando o framework Spring Boot. Utilizando JPA, JUnit Jupiter para testes, consultas nativas, desenvolvimento orientado a testes, princípios de design sólido e gerenciamento de banco de dados PostgreSQL."
          ]
        },
        {
          "title": "desenvolvedor_de_software_trainee",
          "date": "dez/2022 - out/2023",
          "work_type": "Remoto",
          "description": [
            "Proficiente na criação e manutenção de aplicativos usando o framework Spring Boot. Possuo conhecimento em JPA, JUnit Jupiter para testes, consultas nativas, desenvolvimento orientado a testes, princípios de design sólido e gerenciamento de banco de dados PostgreSQL.",
            "Participei ativamente da modernização de sistemas, incluindo a criação de um novo sistema de implantação com Java 17 e a migração bem-sucedida de uma API legada de Java 8 para Java 17, melhorando significativamente a eficiência e a manutenibilidade do sistema.",
            "Desenvolvi interfaces de usuário dinâmicas e responsivas, utilizando desde React até Angular."
          ]
        }
      ]
    },
    {
      "path": "~/experiencia/infra/euroamerican",
      "company": "Euroamerican, Jandira, BR",
      "experience": [
        {
          "title": "analista_de_infraestrutura_pleno",
          "date": "out/2022 - dez/2022",
          "work_type": "Presencial",
          "description": [
            "Manutenção de servidores Windows, administração de Exchange, DHCP, DNS, backups, AD, firewalls e proxies.",
            "Realizei instalação/configuração de hardware e software, migrações de sistemas e atualizações de ferramentas de software."
          ]
        },
        {
          "title": "analista_de_infraestrutura_junior",
          "date": "abr/2022 - out/2022",
          "work_type": "Presencial",
          "description": [
            "Manutenção de servidores Windows, administração de Exchange, DHCP, DNS, backups, AD, firewalls e proxies.",
            "Solucionei problemas do dia a dia envolvendo redes, suporte a usuários e armazenamento de arquivos e aplicativos."
          ]
        },
        {
          "title": "estagiario_de_infraestrutura",
          "date": "out/2021 - abr/2022",
          "work_type": "Presencial",
          "description": [
            "Suporte a usuários.",
            "Atualização e manutenção de máquinas.",
            "Gerenciamento de contas de departamento.",
            "Gerenciamento de tickets (GLPI)."
          ]
        }
      ]
    }
  ],
  "academic_education_info": [
    {
      "path": "~/escolaridade/graduacao",
      "experience": [
        {
          "title": "engenharia_de_software",
          "date": "2023 - 2024",
          "company": "Uniamerica, BR",
          "description": []
        },
        {
          "title": "analise_e_desenvolvimento_de_sistemas",
          "date": "2021 - 2023",
          "company": "Universidade Nove de Julho, São Paulo, BR",
          "description": []
        }
      ]
    },
    {
      "path": "~/escolaridade/ensino_medio",
      "experience": [
        {
          "title": "manutencao_e_suporte_em_informatica",
          "date": "2018 - 2020",
          "company": "Instituto Tecnico de Barueri, Barueri, BR",
          "description": []
        }
      ]
    }
  ],
  "resume": "Sou um entusiasta da tecnologia que começou a explorar o mundo da programação com aproximadamente 15 anos. Atualmente, sou pós-graduado em Engenharia de Software e trabalho como desenvolvedor em uma empresa de tecnologia e desenvolvimento de software. Minha trajetória inclui uma graduação em Análise e Desenvolvimento de Sistemas, e já tive experiência anterior em infraestrutura. No meu dia a dia, construo aplicações sólidas utilizando tecnologias como Java com Spring Boot. Sempre priorizo o Test-Driven Development (TDD) e os princípios SOLID para manter a qualidade do código. Nas horas vagas, sou movido pela curiosidade e gosto de explorar novas tecnologias e desenvolver aplicações utilizando princípios de programação funcional em Golang, como APIs e processadores. Utilizo bancos de dados como MongoDB e PostgreSQL, além de RabbitMQ para gerenciamento de filas. Minha paixão por resolver problemas com código me motiva a estar em constante aprendizado.",
  "project-title": "projetos",
  "project-info": [
    {
      "title": "clean-architecture-example",
        "description": "Esse é um repositorio exemplo do uso de arquitetura limpa.",
      "uri_github": "/springboot-clean-architecture-example",
      "tag": [
        "SpringBoot",
        "Java 21",
        "PostgreSQL"
      ]
    },
    {
      "title": "notificator",
      "description": "Esse é um repositorio de envio de notifições via email, utilizando um serviço de mensageria como gatilho do envio.",
      "uri_github": "/notificator",
      "tag": [
        "SpringBoot",
        "RabbitMQ"
      ]
    },
    {
      "title": "music-streamer-api",
      "description": "Esse é um repositorio de upload e download de músicas com funcionalidade de player permite aos usuários enviar, baixar e ouvir músicas.",
      "uri_github": "/music-streamer-api",
      "tag": [
        "SpringBoot",
        "JPA",
        "PostgreSQL"
      ]
    },
    {
      "title": "my-personal-blog",
      "description": "Esse repositório se refere a esse website.",
      "uri_github": "/my-personal-blog",
      "tag": [
        "React",
        "TypeScript"
      ]
    }
  ]
}
